"""
5.	파이썬 문법 - 문자열, 튜플 자료형 

문자열 변수의 초기화 :  "", '' 로 감싸서 초기화
문자열 내부에 따옴표 포함 : \"
"""

data = "Hello World"
print(data)

data = "Don't you know \"Python\"?"
print(data)



"""
문자열 연산 
문자열에 + 연산 : 문자열을 이어 붙임
문자열에 * 연산 : 문자열을 여러번 더함 (양의정수와 곱하는 경우)
문자열에 대해 인덱싱/슬라이싱 가능, 변경은 불가 
"""

a = "Hello"
b = "World"
print(a + " " + b)

print(a * 3)
print(a[0:3])


"""
튜플 자료형 
리스트와 유사하지만, 한번 선언된 값을 변경할 수 없음
리스트에 비해 공간 효율적 (메모리 사용량이 적음)

서로 다른 형식의 자료형을 묶어서 관리할때 유용함 
변경이 불가능 => 키값으로 사용 가능 
"""



a = (1, 2, 3, 4, 5, 6, 7, 8, 9)
print(a[3])  # 네번째 원소 출력
print(a[1:4]) # 두번째 원소부터 네번째 원소까지 출력
print(a[0:4])

# a[2] = 7  # 오류 발생 


