"""
파이썬 자료형 : 정수형, 실수형, 복소수형, 문자열, 리스트, 튜플, 사전 등 

정수형 : 양의 정수, 음의 정수, 0 포함

실수형 : 소수점 아래의 데이터를 포함
소수부분 또는 정수부분이 0일때 0 생략 가능 
"""

a = -10.22
print(a)  # -10.22

a = 5.    # 소수부분이 0 일때 0 생략 가능 
print(a)  # 5.0

a = -.7   # 정수부분이 0 일때 0 생략 가능
print(a)  # -0.7


"""
지수 표현 방식 : e 또는 E 사용해서 숫자 나타내기 
e 나 E 다음에 오는 수가 10의 지수부
지수표현방식으로 입력된 값은 실수로 처리됨 

ex. 2e9 = 2 * 10^9 = 1000000000
"""

a = 2E9
print(a)  #2000000000.0
print(int(a))  # 2000000000 (정수형)

a = 42.34e1
print(a)  # 423.4

a = 2345e-3
print(a)  # 2.345  




"""
실수형 더 알아보기
2진수 체계에서의 실수형은 실제 실수형이 아님(미세한 오차가 있는 값)

round()함수 사용해서 해결 할 수도 있음 
"""

a = .3 + .6
print(a)   # 0.8999999999999999

print(round(a, 4)) # 0.9

if a == 0.9:
    print(True)
else:
  print(False)  #False 출력 (0.9 가 아님) 




"""
수 자료형의 연산

나누기 연산자(/): 나눠진 결과를 실수형으로 반환
나머지 연산자(%) : 홀짝 체크할 때 잘 사용 
몫 연산자(//)는 나눠진 결과를 정수형으로 반환
거듭 제곱 연산자(**)
"""

a = 7
b = 3

print(a/b)   # 2.3333333333333335
print(a%b)   # 1
print(a//b)  # 2

